{
    "steps": [
        {
            "id": "purlin.record_version_notes",
            "friendly_name": "Record Version & Release Notes",
            "description": "Gathers suggested release notes from git history since the last release, presents them to the user for selection/editing, then records the confirmed version and notes in README.md under '## Releases'.",
            "code": null,
            "agent_instructions": "1. Determine the last release tag: run `git tag --sort=-v:refname | head -1`. If no tags exist, treat everything as new.\n2. Gather candidates: run `git log <last-tag>..HEAD --oneline --no-merges` for commit summaries. Treat each commit line as a release notes candidate.\n3. Synthesize a concise bulleted suggestion list from the above data, grouping by theme (features, fixes, process changes) where possible.\n4. Present the suggestions to the user: 'Suggested release notes since <last-tag> — paste any you would like to include, edit freely, or write your own:'\n5. Ask the user for: (a) the new version number (e.g., 'v1.2.0'), and (b) their release notes (free text; they may copy from suggestions, combine, or replace entirely).\n6. Insert a new entry into README.md under a '## Releases' heading (create if absent). Format: `### <version> — <YYYY-MM-DD>\\n\\n<confirmed release notes text>`."
        },
        {
            "id": "purlin.verify_zero_queue",
            "friendly_name": "Purlin Verify Zero-Queue Status",
            "description": "Verifies that all features are in a fully satisfied state by checking that every feature has architect: 'DONE', builder: 'DONE', and qa is 'CLEAN' or 'N/A'.",
            "code": null,
            "agent_instructions": "Run `tools/cdd/status.sh` and confirm that every entry in the `features` array has `architect: \"DONE\"`, `builder: \"DONE\"`, and `qa` is either `\"CLEAN\"` or `\"N/A\"`. If any feature fails this check, halt the release and report which features are not ready."
        },
        {
            "id": "purlin.verify_dependency_integrity",
            "friendly_name": "Purlin Verify Dependency Integrity",
            "description": "Verifies that the dependency graph is acyclic and all prerequisite links are valid.",
            "code": null,
            "agent_instructions": "Read `.purlin/cache/dependency_graph.json`. Confirm the graph is acyclic and all prerequisite references resolve to existing feature files. If the file is stale or missing, run `tools/cdd/status.sh --graph` to regenerate it. Then perform a reverse reference audit: for each feature that other features depend on, search the parent's body text for mentions of its children's filenames. Classify any matches as structural reversal (blocks release), example coupling (warning), or informational pointer (info). Report any cycles, broken links, or structural reversals."
        },
        {
            "id": "purlin.instruction_audit",
            "friendly_name": "Purlin Agent Instruction Audit",
            "description": "Verifies that .purlin/ override files are consistent with the base instruction layer and do not introduce contradictions.",
            "code": null,
            "agent_instructions": "Check `.purlin/HOW_WE_WORK_OVERRIDES.md`, `.purlin/ARCHITECT_OVERRIDES.md`, `.purlin/BUILDER_OVERRIDES.md`, and `.purlin/QA_OVERRIDES.md` for rules that directly contradict the base instruction files. Check for stale path references and terminology mismatches. Fix any inconsistencies and commit."
        },
        {
            "id": "purlin.doc_consistency_check",
            "friendly_name": "Documentation Consistency Check",
            "description": "Checks that README.md and project documentation accurately reflects the current feature set, with no stale descriptions, removed functionality references, or version mismatches.",
            "code": null,
            "agent_instructions": "1. CONSISTENCY PASS — Check README.md and any docs/ documentation against the current feature set. Fix within existing sections: outdated feature descriptions, removed functionality references, stale file paths, version inconsistencies. Commit fixes with `docs(<scope>): <description>`. Do NOT add new ## sections in this pass.\n\n2. COVERAGE GAP ANALYSIS — Compare features/*.md against README.md sections. Identify feature areas, behaviors, or concepts present in the spec but absent or significantly under-represented in the README. Do not write any content yet.\n\n3. GAP TABLE PRESENTATION — Present a table to the user:\n\n   | Feature / Concept | Gap Summary | Suggested Action |\n   |---|---|---|\n   | <name> | <one-line description of what is missing> | Add to existing section \"<section>\" / New section \"<proposed name>\" |\n\n   Ask: 'The items above are in the spec but not covered in README.md. Would you like to include any? Indicate which rows and I will add content to the suggested section, or a new one you specify.'\n\n4. USER-DIRECTED ADDITIONS — For each gap the user approves:\n   a. Existing section: add content within that section only.\n   b. New section: confirm section name and placement with the user, then create it.\n   c. No approvals: proceed without changes.\n\n5. MANDATE — NEVER add a ## heading to README.md without explicit user confirmation of name and placement (step 4b). Consistency fixes within existing sections do not require confirmation."
        },
        {
            "id": "purlin.push_to_remote",
            "friendly_name": "Push to Remote Repository",
            "description": "Pushes the release commits and any tags to the remote repository (e.g., GitHub). This step can be disabled for air-gapped projects or when a separate CI/CD pipeline handles delivery.",
            "code": "git push && git push --tags",
            "agent_instructions": "Confirm the current branch and remote configuration, then push commits and tags to the remote repository. Warn the user if they are about to force-push or if the remote is ahead. Do not proceed without explicit user confirmation for force-push scenarios."
        }
    ]
}
